
## Plan Result

[CI link](https://github.com/NaokiYazawa/bined-infra/actions/runs/5707315300)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * module.ecs.aws_ecs_service.ecs_service
* Replace
  * module.ecs.aws_ecs_task_definition.ecs_task_definition


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ecs.aws_ecs_service.ecs_service will be updated in-place
  ~ resource "aws_ecs_service" "ecs_service" {
        id                                 = "arn:aws:ecs:ap-northeast-1:761817748648:service/bined-hasura/bined-hasura"
        name                               = "bined-hasura"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/bined-hasura:1" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.ecs_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "ecs_task_definition" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/bined-hasura:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-1:761817748648:task-definition/bined-hasura" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "bined-hasura"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "app"
                        }
                    }
                  - mountPoints      = []
                    name             = "bined-hasura"
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "bined-hasura" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":14,"Program":"tfcmt","SHA1":"6d35143986d89ca5ec9886329fda754b5f254417","Vars":{},"WorkflowName":"Terraform"} -->